<template>
  <div class="event-sub-modal">
    <div class="sublayer" @click="onClose"></div>
    <div class="border">
      <div class="double">
        <div>
          <h6 class="double-title"><b>ヤルタ会談(1945年)</b></h6>
          <p class="double-context">アメリカ・イギリス・ソ連はソ連領内にあるヤルタで第二次世界大戦後の世界のあり方を決める会談を行う。アメリカ・イギリス・ソ連の間でドイツやオーストリアの分割統治やドイツに支配された国々の領土決めが行われた。ソ連はそのヤルタ会談においてヨーロッパの東側の国々であるポーランド・ルーマニア・ブルガリア・ハンガリーなどがソ連の影響下に置かれることになり、さらにドイツはアメリカ・イギリス・フランス・ソ連の四か国で分割占領することが決められた。当時のアメリカ大統領フランクリン・ローズベルトはソ連の要求をほとんど受け入れた。ドイツ降伏後旧ドイツなどのヨーロッパはヤルタ会談で決めた通り、アメリカやイギリスとフランスとソ連によって分割されることになったが、その直後にルーズベルト大統領が急死。後を継いだトルーマンは、東ヨーロッパに共産主義国が続々と誕生しているのを受け、イギリス・フランスなどと手を組み、ソ連に対抗することとなる。</p>
        </div>
        <div>
          <h6 class="double-title"><b>分断国家(1945年)</b></h6>
          <p class="double-context">冷戦の時代には元々一つの国だったが社会主義国と資本主義国が誕生(分断国家)。分断国家の代表的な国はドイツ・朝鮮・ベトナムである。
ソ連占領地域は東ドイツに、アメリカ・イギリス・フランス占領地域は西ドイツとして成立・分断された。また、首都であったベルリンも「ベルリンの壁」を境に西ドイツと東ドイツに分断され、西ベルリンは西ドイツの飛地として東ドイツに孤立されてしまう。朝鮮では1945年の日本敗戦によって北緯36度線を境に北側はソ連。南側はアメリカがそれぞれ占領する形となり1948年に北側では朝鮮民主主義人民共和国(北朝鮮)、南側では大韓民国(韓国)が独立。ベトナムではフランスの植民地だったことに反抗して1945年に独立宣言を出すがこれにフランスが反抗。第一次インドシナ戦争後、北側では社会主義国のベトナム社会主義共和国、南側では資本主義国の南ベトナム共和国が誕生し分断されてしまった。</p>
        </div>
      </div>
      <h6 class="xButton" @click="onClose">x</h6>
    </div>
  </div>
</template>

<script>
export default {
  name: "event2.vue",
  methods:{
    onClose(){
      this.$emit("onClose")
    }
  }
}
</script>

<style scoped>

</style>