<template>
  <div class="event-sub-modal">
    <div class="sublayer" @click="onClose"></div>
    <div class="border">
      <div class="double">
        <div>
          <h6 class="double-title"><b>サラエボ事件(1914年6月28日)</b></h6>
          <p class="double-context">サラエボへ偵察に訪れていたオーストリア=ハンガリー帝国の皇位継続者フランツ・フェルディナント大公が、ボスニア系セルビア人のユーゴスラビアの民族主義者の青年ガブリオ・プリンツィプに暗殺された事件。</p>
        </div>
        <div>
          <h6 class="double-title"><b>七月危機(1914年7月23日)</b></h6>
          <p class="double-context">オーストリア=ハンガリー帝国は、セルビア王国に対して最終通告を発したが、セルビア王国の回答にハンガリー帝国は満足せず、両国は臨時体制へと発展。
          両国は同盟関係が築かれていることもあり、七月危機はヨーロッパ全土を巻き込んだ問題へと発展してしまった。
          </p>
        </div>
        <div>
          <h6 class="double-title"><b>1914年(7月28日)</b></h6>
          <p class="double-context">オーストリア=ハンガリー帝国がセルビアの首都ベオグラードを砲撃。これに対して、ロシア帝国はセルビアを支援する必要があると考え、ロシア帝国から軍隊の動員を許可し第一次世界大戦へと幕が開ける。30日の夕方ロシアの総動員が発表された。さらに翌日の7月31日にオーストリア=ハンガリー帝国、ドイツも同様の発表を行い、ドイツはロシアに対して12時間以内に軍を解除するよう要請。しかし、ロシアはこれを拒否し、ドイツとハンガリー帝国はロシアに宣戦布告。また、フランスは8月2日にドイツを支援するため動員を発表した。</p>
        </div>
        <div>
          <h6 class="double-title"><b>1914年(8月)</b></h6>
          <p class="double-context">ドイツはフランスに対して「ベルギー国内の無害通航権」を要求。しかし、フランスはこれを拒否し、8月3日にドイツ軍はベルギーへ侵攻し、同日、フランスに対して宣戦布告。それに対しベルギー政府は1839年のロンドン条約を公使。
※ロンドン条約とは、ベルギーの独立を認めないネーデルランド王国に対してベルギーが粘り強い国際外交を展開し、ベルギー独立革命から9年かけて完全独立を勝ち取った条約である。
その結果、条約の取り決めに従って8月4日、イギリスがドイツに対して宣戦布告。さらに、8月12日にフランス・イギリスがオーストリア=ハンガリー帝国に対して宣戦布告。8月23日には日本が連合国側についたことで大戦がアジアにも広がった。
</p>
        </div>
        <div>
          <h6 class="double-title"><b>タンネンベルクの戦い(1914年8月26日)</b></h6>
          <p class="double-context">ドイツのヒンデンブルク将軍が、ポーランド北東部のタンネンベルクでロシア軍を全滅させた戦い。</p>
        </div>
        <div>
          <h6 class="double-title"><b>青島の戦い(1914年9月2日)</b></h6>
          <p class="double-context">日本軍が山東半島に上陸を開始した。</p>
        </div>
        <div>
          <h6 class="double-title"><b>マルヌの戦い(1914年9月)</b></h6>
          <p class="double-context">フランス・イギリス軍がパリ当方のマルヌ川でドイツ軍の進撃を食い止め、短期決戦作戦を挫折たせた戦い。西部戦線は行き詰まり、ドイツは東西二面作戦を余儀なくされた。</p>
        </div>
        <div>
          <h6 class="double-title"><b>1914年(11月)</b></h6>
          <p class="double-context">オスマン帝国が同盟側に参戦し、コーカサス、メソポタミア、シナイ半島で戦線が構築。さらに、ヨーロッパ各国の植民地でも戦闘が繰り広げられたことで、戦闘はアフリカに及び、世界規模の大戦と発展していった。</p>
        </div>
      </div>
      <h6 class="xButton" @click="onClose">x</h6>
    </div>
  </div>
</template>

<script>
export default {
  name: "event1.vue",
  methods:{
    onClose(){
      this.$emit("onClose")
    }
  }
}
</script>

<style scoped>

</style>