<template>
  <div class="event-sub-modal">
    <div class="sublayer" @click="onClose"></div>
    <div class="border">
      <div class="double">
        <div>
          <h6 class="double-title"><b>奴隷解放宣言(1863年)</b></h6>
          <p class="double-context">1862年のアンティータムの戦いで連合国軍が勝利したことで、リンカーンは、 「1863年1月1日以降、合衆国軍が戦っていた連合国軍が支配する地域における全ての奴隷たちを解放する」とした、奴隷解放宣言を出した。この解放宣言によって、合衆国側は国際世論を味方につけることに成功した。さらに、南北戦争終戦までに約18万6千人の黒人が、合衆国軍の兵士として参戦することになった。</p>
        </div>
        <div>
          <h6 class="double-title"><b>チャンセラーズヴィルの戦い(1863年春)</b></h6>
          <p class="double-context">南北戦争の中盤、ヴァージニアのスポットシルバニア・コートハウスの村落周辺で起こった戦闘。この戦いでは、連合国、合衆国ともに大きな損害をもたらしたが、連合国の勝利に終わった。この勝利によって、勢いを取り戻したリー軍(連合国)は再度北部侵攻を計画する。</p>
        </div>
        <div>
          <h6 class="double-title"><b>ビックスバーグの戦い(1863年5~7月)</b></h6>
          <p class="double-context">ユリシーズ・グラント少将率いる合衆国軍がミシシッピ州ウォーレン郡で行われたビックスバーグの包囲戦に勝利する。1864年に、リンカーンはグラントを合衆国軍の総司令官に任命。西部戦線をウィリアム・T・シャーマンにまかせ、グラントはワシントンへ向かった。そして、「スポットシルバニア・コートハウスの戦い」や「コールドハーバーの戦い」などを立て続けに起こし、多大な犠牲者を出したにもかかわらず、グラントは戦いをやめず、その後九ヶ月に渡って「リッチモンド・ピーターズバーグの包囲戦」を展開していく。また、西部戦線をまかせれたシャーマンは、９月までにアトランタを占拠。その後「海への進軍」を開始。</p>
        </div>
        <div>
          <h6 class="double-title"><b>ゲティスバーグの戦い(1863年7月)</b></h6>
          <p class="double-context">北部侵攻を開始した連合国軍はペンシルベニア州南部のゲティスバーグにて、ジョージ・ミード率いる合衆国軍と対峙。三日間に及ぶ長期戦の末、合衆国軍が勝利した。しかし、連合国軍の残党はヴァージニアに逃げ込むことに成功した。</p>
        </div>
      </div>
      <h6 class="xButton" @click="onClose">x</h6>
    </div>
  </div>
</template>

<script>
export default {
  name: "event6.vue",
  methods: {
    onClose() {
      this.$emit("onClose")
    }
  }
}
</script>

<style scoped>

</style>